[
  {
    "id": "1",
    "text": "A banana is a yellow fruit that is soft and sweet.",
    "region": "Tropical",
    "type": "Fruit"
  },
  {
    "id": "2",
    "text": "A lemon is yellow and very sour.",
    "region": "Tropical",
    "type": "Fruit"
  },
  {
    "id": "3",
    "text": "A chili pepper is red and extremely spicy.",
    "region": "Various",
    "type": "Spice"
  },
  {
    "id": "4",
    "text": "An apple can be red, green, or yellow and has a sweet taste.",
    "region": "Global",
    "type": "Fruit"
  },
  {
    "id": "5",
    "text": "Biryani is a flavorful Indian rice dish made with spices, rice, and usually meat or vegetables.",
    "region": "Hyderabad",
    "type": "Main Course"
  },
  {
    "id": "6",
    "text": "Samosa is a fried or baked pastry with a spicy potato filling, popular as a snack in India.",
    "region": "North India",
    "type": "Snack"
  },
  {
    "id": "7",
    "text": "Paneer butter masala is a creamy tomato-based curry made with Indian cottage cheese.",
    "region": "Punjab",
    "type": "Main Course"
  },
  {
    "id": "8",
    "text": "Masala dosa is a thin, crispy fermented crepe filled with spicy mashed potatoes.",
    "region": "South India",
    "type": "Breakfast"
  },
  {
    "id": "9",
    "text": "Chole is a spicy chickpea curry from North India, often eaten with rice or bhature.",
    "region": "North India",
    "type": "Main Course"
  },
  {
    "id": "10",
    "text": "Rasgulla is a spongy dessert made from ball-shaped dumplings of chhena cooked in light syrup.",
    "region": "Bengal",
    "type": "Dessert"
  },
  {
    "id": "11",
    "text": "Naan is a soft and fluffy flatbread that is traditionally baked in a tandoor.",
    "region": "North India",
    "type": "Bread"
  },
  {
    "id": "12",
    "text": "Tandoori chicken is chicken marinated in yogurt and spices, roasted in a tandoor.",
    "region": "Punjab",
    "type": "Main Course"
  },
  {
    "id": "13",
    "text": "Gulab jamun is a deep-fried milk-solid ball soaked in sweet syrup, served as dessert.",
    "region": "India",
    "type": "Dessert"
  },
  {
    "id": "14",
    "text": "Pav bhaji is a spicy vegetable mash served with soft buttered buns.",
    "region": "Mumbai",
    "type": "Snack"
  },
  {
    "id": "15",
    "text": "Raita is a yogurt-based condiment that cools down spicy dishes.",
    "region": "India",
    "type": "Condiment"
  },
  {
    "id": "16",
    "text": "Dhokla is a soft and fluffy savory cake made from fermented rice and chickpea flour.",
    "region": "Gujarat",
    "type": "Snack"
  },
  {
    "id": "17",
    "text": "Butter chicken is a rich tomato gravy dish with tender pieces of marinated chicken.",
    "region": "Delhi",
    "type": "Main Course"
  },
  {
    "id": "18",
    "text": "Lassi is a cold yogurt drink blended with sugar, salt, or fruits like mango.",
    "region": "Punjab",
    "type": "Drink"
  }, 
   {
    "id": "19",
    "text": "Momo is a type of South Asian dumpling popular in Nepal, filled with meat or vegetables and served with spicy chutney.",
    "region": "Nepal",
    "type": "Snack"
  },
  {
    "id": "20",
    "text": "Sel roti is a traditional homemade, sweet, ring-shaped rice bread from Nepal.",
    "region": "Nepal",
    "type": "Dessert"
  },
  {
    "id": "21",
    "text": "Hilsa curry is a traditional Bengali dish made with hilsa fish and mustard gravy.",
    "region": "Bangladesh",
    "type": "Main Course"
  },
  {
    "id": "22",
    "text": "Bhuna khichuri is a spiced rice and lentil dish often served with beef curry in Bangladesh.",
    "region": "Bangladesh",
    "type": "Main Course"
  },
  {
    "id": "23",
    "text": "Nihari is a slow-cooked stew of beef or lamb, eaten as breakfast in Pakistan.",
    "region": "Pakistan",
    "type": "Main Course"
  },
  {
    "id": "24",
    "text": "Chicken Karahi is a spicy curry cooked in a wok-like pan called a karahi, popular in Pakistan.",
    "region": "Pakistan",
    "type": "Main Course"
  },
  {
    "id": "25",
    "text": "Pad Thai is a stir-fried noodle dish with shrimp, peanuts, and tamarind sauce, one of Thailand's national dishes.",
    "region": "Thailand",
    "type": "Main Course"
  },
  {
    "id": "26",
    "text": "Tom Yum is a hot and sour Thai soup made with shrimp, lemongrass, and lime juice.",
    "region": "Thailand",
    "type": "Soup"
  },
  {
    "id": "27",
    "text": "Pho is a Vietnamese noodle soup consisting of broth, rice noodles, herbs, and meat.",
    "region": "Vietnam",
    "type": "Soup"
  },
  {
    "id": "28",
    "text": "Nasi Goreng is Indonesian-style fried rice often cooked with kecap manis, garlic, shallots, and chili.",
    "region": "Indonesia",
    "type": "Main Course"
  },
  {
    "id": "29",
    "text": "Rendang is a spicy meat dish slow-cooked in coconut milk and spices, originating from Indonesia.",
    "region": "Indonesia",
    "type": "Main Course"
  },
  {
    "id": "30",
    "text": "Nasi lemak is Malaysia's national dish consisting of fragrant rice cooked in coconut milk, served with sambal, anchovies, and egg.",
    "region": "Malaysia",
    "type": "Main Course"
  },
  {
    "id": "31",
    "text": "Adobo is a Filipino dish made by marinating meat in vinegar, soy sauce, and garlic, then simmering it.",
    "region": "Philippines",
    "type": "Main Course"
  },
  {
    "id": "32",
    "text": "Halo-halo is a Filipino dessert made from crushed ice, evaporated milk, and mixed ingredients like sweet beans, fruits, and jellies.",
    "region": "Philippines",
    "type": "Dessert"
  }, 
    {
    "id": "33",
    "text": "Peking duck is a famous Beijing dish featuring crispy roasted duck served with pancakes, hoisin sauce, and scallions.",
    "region": "China",
    "type": "Main Course"
  },
  {
    "id": "34",
    "text": "Kung Pao chicken is a spicy stir-fry dish made with chicken, peanuts, vegetables, and chili peppers.",
    "region": "China",
    "type": "Main Course"
  },
  {
    "id": "35",
    "text": "Mapo tofu is a Sichuan dish featuring soft tofu in a spicy chili and bean-based sauce, typically with minced pork.",
    "region": "Sichuan, China",
    "type": "Main Course"
  },
  {
    "id": "36",
    "text": "Xiao long bao are Chinese soup dumplings filled with meat and hot broth, typically served in a bamboo steamer.",
    "region": "Shanghai",
    "type": "Snack"
  },
  {
    "id": "37",
    "text": "Chow mein is a stir-fried noodle dish made with vegetables and sometimes meat or seafood.",
    "region": "China",
    "type": "Noodle"
  },
  {
    "id": "38",
    "text": "Hot and sour soup is a Chinese soup made with mushrooms, tofu, bamboo shoots, and egg, flavored with vinegar and white pepper.",
    "region": "China",
    "type": "Soup"
  },
  {
    "id": "39",
    "text": "Dim sum refers to a variety of small Chinese dishes served with tea, including dumplings, buns, and rolls.",
    "region": "Cantonese, China",
    "type": "Snack"
  },
  {
    "id": "40",
    "text": "Mooncake is a traditional Chinese pastry filled with lotus seed paste or red bean, eaten during the Mid-Autumn Festival.",
    "region": "China",
    "type": "Dessert"
  }, 
  {
  "id": "41",
  "text": "Kimchi is a traditional Korean side dish made from fermented vegetables, usually cabbage and radish, with chili pepper and garlic.",
  "region": "Korea",
  "type": "Side Dish"
},
{
  "id": "42",
  "text": "Bibimbap is a Korean mixed rice dish topped with sautéed vegetables, sliced meat, a fried egg, and chili paste.",
  "region": "Korea",
  "type": "Main Course"
},
{
  "id": "43",
  "text": "Tteokbokki is a popular Korean street food made of chewy rice cakes in a spicy red sauce.",
  "region": "Korea",
  "type": "Snack"
}, 
{
  "id": "44",
  "text": "Beef noodle soup is a beloved Taiwanese dish made with braised beef, vegetables, and noodles in a flavorful broth.",
  "region": "Taiwan",
  "type": "Soup"
},
{
  "id": "45",
  "text": "Lu rou fan is a classic Taiwanese comfort food of minced pork belly cooked in soy sauce, served over rice.",
  "region": "Taiwan",
  "type": "Main Course"
},
{
  "id": "46",
  "text": "Bubble tea is a Taiwanese drink made with tea, milk, and chewy tapioca pearls.",
  "region": "Taiwan",
  "type": "Drink"
}, 
{
  "id": "47",
  "text": "Char siu is a Cantonese-style barbecued pork known for its sweet and savory glaze.",
  "region": "Hong Kong",
  "type": "Main Course"
},
{
  "id": "48",
  "text": "Egg tarts are a popular Hong Kong dessert consisting of a flaky pastry crust filled with egg custard.",
  "region": "Hong Kong",
  "type": "Dessert"
},
{
  "id": "49",
  "text": "Wonton noodles are a Hong Kong dish made with thin egg noodles and wontons in a clear broth.",
  "region": "Hong Kong",
  "type": "Noodle"
}, 
{
  "id": "50",
  "text": "Meat pie is an iconic Australian dish consisting of a flaky pastry filled with minced meat and gravy.",
  "region": "Australia",
  "type": "Snack"
},
{
  "id": "51",
  "text": "Lamingtons are sponge cakes coated in chocolate and rolled in coconut, a popular Australian dessert.",
  "region": "Australia",
  "type": "Dessert"
} ,
{
  "id": "52",
  "text": "Pavlova is a meringue-based dessert topped with fresh fruit and cream, considered a national dish of New Zealand.",
  "region": "New Zealand",
  "type": "Dessert"
},
{
  "id": "53",
  "text": "Hangi is a traditional Māori method of cooking meat and vegetables in an underground oven.",
  "region": "New Zealand",
  "type": "Main Course"
},
{
  "id": "54",
  "text": "Palusami is a Polynesian dish of taro leaves filled with coconut cream and sometimes meat, baked in banana leaves.",
  "region": "Samoa, South Pacific",
  "type": "Main Course"
},
{
  "id": "55",
  "text": "Oka is a Samoan raw fish salad marinated in citrus and coconut milk, similar to ceviche.",
  "region": "Samoa, South Pacific",
  "type": "Appetizer"
},
{
  "id": "56",
  "text": "Lovo is a Fijian feast where food is wrapped in banana leaves and cooked in an earth oven.",
  "region": "Fiji, South Pacific",
  "type": "Main Course"
}
,
{
  "id": "57",
  "text": "Kokoda is a Fijian dish of raw fish marinated in lime juice and coconut milk, similar to ceviche.",
  "region": "Fiji, South Pacific",
  "type": "Appetizer"
},
{
  "id": "58",
  "text": "Poke is a Hawaiian dish of diced raw fish, typically seasoned with soy sauce and sesame oil.",
  "region": "Hawaii, USA",
  "type": "Appetizer"
},
{
  "id": "59",
  "text": "Spam musubi is a Hawaiian snack made of rice and Spam wrapped in seaweed.",
  "region": "Hawaii, USA",
  "type": "Snack"
},
{  "id": "60",
  "text": "Loco moco is a Hawaiian dish consisting of rice topped with a hamburger patty, fried egg, and brown gravy.",
  "region": "Hawaii, USA",
  "type": "Main Course"
},
{
  "id": "61",
  "text": "Sushi is a Japanese dish of vinegared rice combined with seafood, vegetables, and sometimes tropical fruits.",
  "region": "Japan",
  "type": "Main Course"
},
{
  "id": "62",
  "text": "Ramen is a Japanese noodle soup dish with Chinese-style wheat noodles served in a meat or fish-based broth.",
  "region": "Japan",
  "type": "Main Course"
},
{
  "id": "63",
  "text": "Tempura is a Japanese dish of seafood or vegetables that have been battered and deep-fried.",
  "region": "Japan",
  "type": "Main Course"
},
{
  "id": "64",
  "text": "Miso soup is a traditional Japanese soup consisting of a stock called dashi into which softened miso paste is mixed.",
  "region": "Japan",
  "type": "Soup"
},
{
  "id": "65",
  "text": "Okonomiyaki is a savory Japanese pancake containing a variety of ingredients.",
  "region": "Japan",
  "type": "Main Course"
},
{
  "id": "66",
  "text": "Hummus is a Middle Eastern dip or spread made from cooked, mashed chickpeas blended with tahini, olive oil, lemon juice, and garlic.",
  "region": "Middle East",
  "type": "Appetizer"
},
{
  "id": "67",
  "text": "Falafel consists of deep-fried balls of ground chickpeas or fava beans, typically served in pita bread.",
  "region": "Middle East",
  "type": "Main Course"
},
{
  "id": "68",
  "text": "Shawarma is a Middle Eastern meat preparation where thin slices of lamb, chicken, or beef are stacked and roasted on a vertical rotisserie.",
  "region": "Middle East",
  "type": "Main Course"
},
{
  "id": "69",
  "text": "Tabbouleh is a Levantine vegetarian salad made of finely chopped parsley, tomatoes, mint, and bulgur.",
  "region": "Middle East",
  "type": "Salad"
},
{
  "id": "70",
  "text": "Baklava is a rich, sweet dessert pastry made of layers of filo filled with chopped nuts and sweetened with syrup or honey.",
  "region": "Middle East",
  "type": "Dessert"
},
{
  "id": "71",
  "text": "Buuz are Mongolian steamed dumplings filled with minced meat, typically mutton or beef.",
  "region": "Mongolia",
  "type": "Main Course"
},
{
  "id": "72",
  "text": "Khorkhog is a Mongolian barbecue dish where meat is cooked with hot stones inside a sealed container.",
  "region": "Mongolia",
  "type": "Main Course"
},
{
  "id": "73",
  "text": "Airag is a traditional Mongolian alcoholic drink made from fermented mare's milk.",
  "region": "Mongolia",
  "type": "Beverage"
},
{
  "id": "74",
  "text": "Boortsog are Mongolian deep-fried cookies often served with tea or used as a dessert.",
  "region": "Mongolia",
  "type": "Dessert"
},
{
  "id": "75",
  "text": "Suutei tsai is a traditional Mongolian milk tea made with green tea, milk, water, and salt.",
  "region": "Mongolia",
  "type": "Beverage"
},
{
  "id": "76",
  "text": "Borscht is a traditional Eastern European soup made primarily from beetroot, giving it a distinctive deep red color. This hearty soup is prepared by simmering fresh beetroot with cabbage, carrots, onions, and often includes beef or pork for added richness. The soup is typically finished with a dollop of sour cream and fresh dill. Borscht has been a staple food in Ukrainian, Russian, and Polish cuisines for centuries, often served during cold winters for its warming properties. The dish is rich in folate, vitamin C, and antioxidants from beetroot, making it both nutritious and flavorful. Different regions have their own variations, with some adding beans or potatoes.",
  "region": "Ukraine",
  "type": "Main Course",
  "category": "Traditional Soup",
  "origin": "Eastern Europe",
  "ingredients": ["beetroot", "cabbage", "carrots", "onions", "beef/pork", "sour cream", "dill"],
  "preparation": "Simmering vegetables and meat in broth",
  "nutrition": "High in folate, vitamin C, antioxidants",
  "cultural_significance": "Traditional winter comfort food",
  "dietary": ["gluten-free"]
},
{
  "id": "77",
  "text": "Pierogies are traditional Polish dumplings made from unleavened dough filled with various ingredients such as mashed potatoes, cheese, sauerkraut, mushrooms, or meat. The dough is rolled thin, cut into circles, filled, and sealed into half-moon shapes before being boiled and often pan-fried until golden. These beloved dumplings are typically served with caramelized onions, sour cream, and bacon bits. Pierogies hold deep cultural significance in Polish families, often prepared during holidays and special occasions as a way to bring generations together. They represent comfort food at its finest and are now popular worldwide. The dish provides carbohydrates and protein, and can be made vegetarian or vegan depending on the filling.",
  "region": "Poland",
  "type": "Main Course",
  "category": "Traditional Dumpling",
  "origin": "Poland",
  "ingredients": ["flour", "water", "potatoes", "cheese", "onions", "sour cream"],
  "preparation": "Dough making, filling, boiling, pan-frying",
  "nutrition": "Carbohydrates, protein, calcium",
  "cultural_significance": "Family tradition and holiday food",
  "dietary": ["vegetarian-option"]
},
{
  "id": "78",
  "text": "Golumpki (stuffed cabbage rolls) are a cherished dish in Polish cuisine, consisting of tender cabbage leaves wrapped around a savory filling of ground meat, rice, and seasonings. The preparation involves blanching whole cabbage leaves until pliable, then filling them with a mixture of ground beef or pork, cooked rice, onions, and herbs. The rolls are carefully wrapped and simmered in a rich tomato-based sauce for several hours until the flavors meld together. This dish represents the heart of Polish home cooking, often prepared for Sunday dinners and special family gatherings. Golumpki provides a balanced meal with protein from meat, complex carbohydrates from rice, and vitamins from cabbage, making it both satisfying and nutritious.",
  "region": "Poland",
  "type": "Main Course",
  "category": "Traditional Comfort Food",
  "origin": "Poland",
  "ingredients": ["cabbage", "ground meat", "rice", "onions", "tomato sauce", "herbs"],
  "preparation": "Blanching, stuffing, rolling, simmering",
  "nutrition": "Protein, complex carbohydrates, vitamin K, fiber",
  "cultural_significance": "Sunday dinner tradition",
  "dietary": ["gluten-free"]
},
{
  "id": "79",
  "text": "Kielbasa is a traditional Polish sausage made from pork, beef, or a combination of both, seasoned with garlic, marjoram, and other spices. The meat is ground and stuffed into natural casings, then smoked or fresh-cooked depending on the variety. This versatile sausage can be grilled, pan-fried, or added to stews and soups. Kielbasa has been a cornerstone of Polish cuisine for centuries, originally developed as a way to preserve meat before refrigeration. The smoking process not only preserves the sausage but also imparts a distinctive flavor that makes it instantly recognizable. High in protein and often lower in fat than many processed meats, kielbasa remains a popular choice for hearty meals and is enjoyed by Polish communities worldwide.",
  "region": "Poland",
  "type": "Main Course",
  "category": "Traditional Sausage",
  "origin": "Poland",
  "ingredients": ["pork", "beef", "garlic", "marjoram", "spices", "natural casings"],
  "preparation": "Grinding, stuffing, smoking or cooking",
  "nutrition": "High protein, moderate fat",
  "cultural_significance": "Traditional preservation method, national dish",
  "dietary": ["gluten-free"]
},
{
  "id": "80",
  "text": "Sernik is a beloved Polish cheesecake made with twaróg (Polish farmer's cheese), creating a dense, creamy texture distinct from American-style cheesecakes. The base typically consists of crushed cookies or graham crackers mixed with butter, while the filling combines twaróg with eggs, sugar, vanilla, and sometimes raisins or orange zest. The cake is baked slowly until set and golden on top. Sernik holds special significance in Polish culture, often served during Easter celebrations and family gatherings. The use of twaróg, a traditional Polish cheese, provides high protein content and calcium while maintaining a lighter texture than cream cheese-based desserts. Each family often has their own secret recipe passed down through generations.",
  "region": "Poland",
  "type": "Dessert",
  "category": "Traditional Cheesecake",
  "origin": "Poland",
  "ingredients": ["twaróg cheese", "eggs", "sugar", "vanilla", "cookies", "butter"],
  "preparation": "Mixing, baking slowly",
  "nutrition": "High protein, calcium, moderate sugar",
  "cultural_significance": "Easter tradition, family recipes",
  "dietary": ["vegetarian"]
},
{
  "id": "81",
  "text": "Quinoa Buddha Bowl is a modern superfood creation featuring fluffy quinoa as the base, topped with an array of colorful, nutrient-dense vegetables, legumes, and healthy fats. A typical bowl includes roasted sweet potatoes, steamed broccoli, fresh spinach, chickpeas, avocado slices, and pumpkin seeds, all drizzled with tahini or lemon-herb dressing. This complete meal provides all essential amino acids from quinoa, making it an excellent plant-based protein source. The combination offers fiber, vitamins A, C, and K, folate, and healthy omega-3 fatty acids. Buddha bowls represent the modern approach to healthy eating, emphasizing whole foods, vibrant colors, and balanced nutrition in one satisfying meal.",
  "region": "Global",
  "type": "Main Course",
  "category": "Healthy Bowl",
  "origin": "Modern Health Food Movement",
  "ingredients": ["quinoa", "sweet potatoes", "broccoli", "spinach", "chickpeas", "avocado", "pumpkin seeds", "tahini"],
  "preparation": "Cooking quinoa, roasting vegetables, assembling",
  "nutrition": "Complete proteins, fiber, vitamins A, C, K, omega-3s",
  "cultural_significance": "Modern wellness cuisine",
  "dietary": ["vegan", "gluten-free"]
},
{
  "id": "82",
  "text": "Açaí Bowl is a Brazilian superfood breakfast made from frozen açaí berries blended into a thick, sorbet-like consistency and topped with fresh fruits, granola, coconut flakes, and nuts. The açaí palm berry, native to the Amazon rainforest, is packed with antioxidants, particularly anthocyanins, which give the berry its deep purple color and provide anti-inflammatory benefits. The bowl typically includes banana, strawberries, blueberries, and a sprinkle of chia seeds for added omega-3 fatty acids. This nutritious breakfast provides sustained energy, supports heart health, and delivers vitamin C, fiber, and healthy fats. Açaí bowls have become a symbol of healthy living and are popular in Brazilian beach culture and health-conscious communities worldwide.",
  "region": "Brazil",
  "type": "Breakfast",
  "category": "Superfood Bowl",
  "origin": "Brazil",
  "ingredients": ["açaí berries", "banana", "strawberries", "blueberries", "granola", "coconut", "chia seeds"],
  "preparation": "Blending frozen açaí, adding toppings",
  "nutrition": "Antioxidants, vitamin C, fiber, omega-3s",
  "cultural_significance": "Brazilian beach culture, wellness trend",
  "dietary": ["vegan", "gluten-free-option"]
},
{
  "id": "83",
  "text": "Chia Pudding is a nutrient-dense dessert or breakfast made by soaking chia seeds in plant-based milk until they form a creamy, pudding-like consistency. The tiny seeds absorb liquid and expand to create a gel-like texture rich in omega-3 fatty acids, fiber, and protein. Common variations include vanilla, chocolate, or fruit-flavored versions, topped with fresh berries, nuts, or coconut flakes. This ancient superfood was prized by the Aztecs and Mayans for its energy-sustaining properties. Modern nutritionists value chia pudding for its ability to provide sustained energy, support digestive health, and deliver essential minerals like calcium, magnesium, and phosphorus. It's naturally gluten-free and can be prepared ahead of time for convenient, healthy meals.",
  "region": "Central America",
  "type": "Breakfast",
  "category": "Superfood Pudding",
  "origin": "Ancient Mesoamerica",
  "ingredients": ["chia seeds", "plant milk", "vanilla", "berries", "nuts", "coconut"],
  "preparation": "Soaking seeds overnight",
  "nutrition": "Omega-3s, fiber, protein, calcium, magnesium",
  "cultural_significance": "Ancient Aztec and Mayan superfood",
  "dietary": ["vegan", "gluten-free"]
},
{
  "id": "84",
  "text": "Kale and Sweet Potato Salad is a vibrant, nutrient-packed dish combining massaged kale leaves with roasted sweet potatoes, creating a perfect balance of textures and flavors. The kale is massaged with lemon juice and olive oil to soften its texture, while sweet potatoes are roasted until caramelized. The salad often includes pumpkin seeds, dried cranberries, and a tahini-based dressing. This powerhouse combination provides vitamin A from sweet potatoes, vitamin K and iron from kale, and healthy fats from seeds and dressing. The dish represents the farm-to-table movement and emphasizes seasonal, whole food ingredients. It's become popular among health enthusiasts for its ability to deliver maximum nutrition while satisfying taste preferences.",
  "region": "North America",
  "type": "Salad",
  "category": "Healthy Salad",
  "origin": "Modern Health Food Movement",
  "ingredients": ["kale", "sweet potatoes", "pumpkin seeds", "cranberries", "tahini", "lemon", "olive oil"],
  "preparation": "Massaging kale, roasting sweet potatoes, assembling",
  "nutrition": "Vitamin A, vitamin K, iron, healthy fats",
  "cultural_significance": "Farm-to-table movement",
  "dietary": ["vegan", "gluten-free"]
},
{
  "id": "85",
  "text": "Green Smoothie Bowl is a nutrient-dense breakfast featuring a thick blend of leafy greens, fruits, and superfoods, served in a bowl and topped with various healthy ingredients. The base typically combines spinach or kale with frozen banana, mango, and coconut water, creating a creamy, ice cream-like texture. Toppings include fresh fruits, nuts, seeds, and coconut flakes arranged artistically on top. This colorful bowl provides an easy way to consume multiple servings of vegetables and fruits in one meal. The combination delivers vitamins A, C, and K, folate, potassium, and antioxidants while supporting detoxification and immune function. Green smoothie bowls have become Instagram favorites and represent the intersection of nutrition and visual appeal in modern healthy eating.",
  "region": "Global",
  "type": "Breakfast",
  "category": "Smoothie Bowl",
  "origin": "Modern Health Food Movement",
  "ingredients": ["spinach", "kale", "banana", "mango", "coconut water", "berries", "nuts", "seeds"],
  "preparation": "Blending greens and fruits, adding toppings",
  "nutrition": "Vitamins A, C, K, folate, potassium, antioxidants",
  "cultural_significance": "Social media health trend",
  "dietary": ["vegan", "gluten-free"]
},
{
  "id": "86",
  "text": "Paella is Spain's most famous rice dish, originating from the Valencia region, where it was traditionally cooked over an open fire in a wide, shallow pan called a paellera. The authentic Valencian paella combines Bomba rice with chicken, rabbit, green beans, lima beans, tomatoes, and saffron, which gives the dish its characteristic golden color and distinctive flavor. The cooking technique involves creating a socarrat (crispy bottom layer) that adds texture and depth to the dish. Paella represents the essence of Spanish communal dining, bringing families and friends together around the pan. The dish varies by region, with seafood versions popular along the coast and mixed paellas combining meat and seafood. The saffron not only provides flavor but also contains antioxidants and has been valued for its medicinal properties throughout history.",
  "region": "Spain",
  "type": "Main Course",
  "category": "Traditional Rice Dish",
  "origin": "Valencia, Spain",
  "ingredients": ["Bomba rice", "chicken", "rabbit", "green beans", "lima beans", "saffron", "tomatoes"],
  "preparation": "Cooking in paellera over open fire, creating socarrat",
  "nutrition": "Complex carbohydrates, protein, antioxidants from saffron",
  "cultural_significance": "Communal dining tradition, regional pride",
  "dietary": ["gluten-free"]
},
{
  "id": "87",
  "text": "Coq au Vin is a classic French dish that exemplifies the country's mastery of braising techniques, featuring chicken slowly cooked in red wine with aromatic vegetables and herbs. The dish begins by marinating chicken pieces in red wine, typically Burgundy, before browning them and braising with onions, mushrooms, carrots, and a bouquet garni of fresh herbs. The long, slow cooking process allows the wine to tenderize the meat while creating a rich, complex sauce. This peasant dish has roots in ancient Gaul and represents French culinary philosophy of transforming simple ingredients into elegant cuisine through technique and patience. The dish provides high-quality protein while the wine contributes antioxidants, and the vegetables add fiber and vitamins.",
  "region": "France",
  "type": "Main Course",
  "category": "Classic Braised Dish",
  "origin": "Burgundy, France",
  "ingredients": ["chicken", "red wine", "onions", "mushrooms", "carrots", "herbs", "bacon"],
  "preparation": "Marinating, browning, braising slowly",
  "nutrition": "High protein, antioxidants, vitamins from vegetables",
  "cultural_significance": "French culinary tradition, peasant origins",
  "dietary": ["gluten-free"]
},
{
  "id": "88",
  "text": "Thai Green Curry is an aromatic and spicy curry made with fresh green chilies, Thai basil, coconut milk, and a variety of vegetables or meat. The curry paste is traditionally made by pounding green chilies, galangal, lemongrass, shallots, garlic, and shrimp paste in a mortar and pestle. The paste is then cooked with coconut milk to create a fragrant base, followed by the addition of vegetables like Thai eggplant, bamboo shoots, and protein such as chicken or tofu. The dish is finished with fresh Thai basil leaves and served over jasmine rice. This curry represents the perfect balance of Thai flavors: spicy, sweet, sour, and salty. The herbs and spices provide anti-inflammatory properties, while coconut milk offers healthy medium-chain fatty acids.",
  "region": "Thailand",
  "type": "Main Course",
  "category": "Curry",
  "origin": "Central Thailand",
  "ingredients": ["green chilies", "coconut milk", "Thai basil", "galangal", "lemongrass", "Thai eggplant"],
  "preparation": "Grinding paste, cooking with coconut milk, simmering",
  "nutrition": "Anti-inflammatory compounds, healthy fats, vitamins",
  "cultural_significance": "Thai flavor balance philosophy",
  "dietary": ["gluten-free", "vegan-option"]
},
{
  "id": "89",
  "text": "Osso Buco is a traditional Italian dish from Milan, featuring cross-cut veal shanks braised with vegetables, white wine, and broth. The dish's name literally means 'bone with a hole,' referring to the marrow-filled bone at the center of each shank. The cooking process involves dredging the shanks in flour, browning them, then braising slowly with onions, carrots, celery, tomatoes, and white wine. The dish is traditionally served with risotto alla milanese (saffron risotto) and topped with gremolata, a mixture of lemon zest, garlic, and parsley. This Lombard specialty represents Italian comfort food at its finest, requiring patience and technique to achieve the perfect tender texture. The bone marrow provides collagen and minerals, while the slow braising method creates a rich, nutritious sauce.",
  "region": "Italy",
  "type": "Main Course",
  "category": "Braised Meat",
  "origin": "Milan, Italy",
  "ingredients": ["veal shanks", "white wine", "onions", "carrots", "celery", "tomatoes", "gremolata"],
  "preparation": "Browning, braising slowly for hours",
  "nutrition": "High protein, collagen, minerals from bone marrow",
  "cultural_significance": "Milanese tradition, Sunday dinner",
  "dietary": ["gluten-free-option"]
},
{
  "id": "90",
  "text": "Moroccan Tagine is a slow-cooked stew named after the distinctive cone-shaped earthenware pot in which it's prepared. This North African dish combines meat (typically lamb, chicken, or beef) with vegetables, dried fruits, and a complex blend of spices including cinnamon, ginger, turmeric, and saffron. The conical lid of the tagine pot creates a unique steam circulation that keeps ingredients moist while concentrating flavors. Common variations include chicken with preserved lemons and olives, or lamb with apricots and almonds. The dish represents the crossroads of African, Arab, and Mediterranean influences in Moroccan cuisine. The spices provide numerous health benefits, including anti-inflammatory properties, while the cooking method preserves nutrients and creates incredibly tender meat. Tagine is traditionally served with couscous or flatbread for a complete meal.",
  "region": "Morocco",
  "type": "Main Course",
  "category": "Slow-Cooked Stew",
  "origin": "Morocco",
  "ingredients": ["lamb/chicken", "preserved lemons", "olives", "dried fruits", "cinnamon", "ginger", "saffron"],
  "preparation": "Slow cooking in tagine pot",
  "nutrition": "Protein, anti-inflammatory spices, vitamins from vegetables",
  "cultural_significance": "Berber and Arab culinary fusion",
  "dietary": ["gluten-free"]
}
]
